app/Models/Usuario_Model.php

SELECT *
FROM "usuario"
WHERE "username" = 'camilaandrade'
 LIMIT 1
INSERT INTO "usuario" ("username", "nome", "senha") VALUES ('camilaandrade', 'Camila Andrade', '1b57b17b2b86fa039d00d29f4ee57fd7')
---
        public function cadastrarNovoUsuario($username,$nome,$senha){
            echo $username;
            // $db=db_connect();
            // $builder=$db->table('usuario');
            // $builder->select('*');
            // $query=$builder->get();

            $buscaUsuario=$this->asArray()->where(['username' => $username])->first();
            if($buscaUsuario==null){
                $data=[
                    'username' => $username,
                    'nome'  => $nome,
                    'senha'  => md5($senha),
                ];
                print_r($data);
                return $this->insert($data);

SELECT *
FROM "usuario"
WHERE "username" = 'camilaandrade'
AND "senha" = '1b57b17b2b86fa039d00d29f4ee57fd7'
 LIMIT 1
---
        public function checkUserPassword($data){
            return $this->where(['username' => $data['username'], 'senha' => md5($data['senha'])])->first();